# Carga de Datos

[https://www.kaggle.com/c/titanic/data](https://www.kaggle.com/c/titanic/data)

References:

[https://www.kaggle.com/arthurtok/introduction-to-ensembling-stacking-in-python#Ensembling-&-Stacking-models](https://www.kaggle.com/arthurtok/introduction-to-ensembling-stacking-in-python#Ensembling-&-Stacking-models)
<br></br>
[https://www.youtube.com/watch?v=f1y9wDDxWnA](https://www.youtube.com/watch?v=f1y9wDDxWnA)
<br></br>
[https://github.com/mrdbourke/your-first-kaggle-submission/blob/master/kaggle-titanic-dataset-example-submission-workflow.ipynb](https://github.com/mrdbourke/your-first-kaggle-submission/blob/master/kaggle-titanic-dataset-example-submission-workflow.ipynb)
<br></br>
[https://www.youtube.com/watch?v=oI05ib6BdLw(https://www.youtube.com/watch?v=oI05ib6BdLw](https://www.youtube.com/watch?v=oI05ib6BdLw)
<br></br>
[http://ligdigonzalez.com/predecir-la-supervivencia-del-titanic-utilizando-python/](http://ligdigonzalez.com/predecir-la-supervivencia-del-titanic-utilizando-python/)
<br></br>
[https://www.youtube.com/watch?v=GXWBzcAzjoQ](https://www.youtube.com/watch?v=GXWBzcAzjoQ)
<br></br>
[https://github.com/minsuk-heo/kaggle-titanic/blob/master/titanic-solution.ipynb](https://github.com/minsuk-heo/kaggle-titanic/blob/master/titanic-solution.ipynb)

In [1]:
%load_ext watermark
%watermark

2020-01-21T12:25:15+01:00

CPython 3.7.4
IPython 7.8.0

compiler   : MSC v.1915 64 bit (AMD64)
system     : Windows
release    : 10
machine    : AMD64
processor  : AMD64 Family 23 Model 24 Stepping 1, AuthenticAMD
CPU cores  : 8
interpreter: 64bit

## Carga de Datos

In [2]:
import pandas as pd
import numpy as np
import re
import warnings

warnings.filterwarnings('ignore')

In [3]:
df_train = pd.read_csv('../NR - Data/titanic-train.csv')

df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df_train.shape

(891, 12)

In [6]:
df_test = pd.read_csv('../NR - Data/titanic-test.csv')

df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:
df

## Feature Engineering

In [5]:
list_df = [df_train,df_test]

### Longitud del Nombre

In [6]:
for df in list_df:
    df['Name_length'] = df['Name'].apply(len)

#df_train['Name_length'] = df_train['Name'].apply(len)
#df_test['Name_length'] = df_test['Name'].apply(len)

### ¿Tiene Cabina?

In [7]:
for df in list_df:
    df['Has_Cabin'] = df["Cabin"].apply(lambda x: 0 if type(x) == float else 1)

#df_train['Has_Cabin'] = df_train["Cabin"].apply(lambda x: 0 if type(x) == float else 1)
#df_test['Has_Cabin'] = df_test["Cabin"].apply(lambda x: 0 if type(x) == float else 1)

### Tamaño de la Familia

In [8]:
for df in list_df:
    df['FamilySize'] = df['SibSp'] + df['Parch'] + 1

### ¿Está Solo?

In [9]:
for df in list_df:
    df['IsAlone'] = 0
    df.loc[df['FamilySize'] == 1,'IsAlone'] = 1

### Eliminar NaN's  de la Columna 'Embarked'

In [10]:
df_train['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
for df in list_df:
    df['Embarked'] = df['Embarked'].fillna('S')

In [12]:
df_train['Embarked'].isna().sum()

0

### ¿Qué tipo de billete tiene?

In [13]:
for df in list_df:
    df['Fare'] = df['Fare'].fillna(df_train['Fare'].median())

In [14]:
df_train['CategoricalFare'] = pd.qcut(df_train['Fare'],4)

In [15]:
df_train['CategoricalFare'].head()

0     (-0.001, 7.91]
1    (31.0, 512.329]
2     (7.91, 14.454]
3    (31.0, 512.329]
4     (7.91, 14.454]
Name: CategoricalFare, dtype: category
Categories (4, interval[float64]): [(-0.001, 7.91] < (7.91, 14.454] < (14.454, 31.0] < (31.0, 512.329]]

### Variable Categórica de Edad

In [16]:
for df in list_df:
    age_avg = df['Age'].mean()
    age_std = df['Age'].std()
    age_null_count = df['Age'].isnull().sum()
    age_null_random_list = np.random.randint(age_avg - age_std,age_avg + age_std,size = age_null_count)
    df['Age'][np.isnan(df['Age'])] = age_null_random_list
    df['Age'] = df['Age'].astype(int)

In [17]:
df_train['CategoricalAge'] = pd.cut(df_train['Age'],5)

In [18]:
df_train['CategoricalAge'].head()

0    (16.0, 32.0]
1    (32.0, 48.0]
2    (16.0, 32.0]
3    (32.0, 48.0]
4    (32.0, 48.0]
Name: CategoricalAge, dtype: category
Categories (5, interval[float64]): [(-0.08, 16.0] < (16.0, 32.0] < (32.0, 48.0] < (48.0, 64.0] < (64.0, 80.0]]

### Estatus Social

In [19]:
def get_title(name):
    title_search = re.search(' ([A-Za-z]+)\.',name)
    if title_search:
        return title_search.group(1)
    return ""

In [20]:
for df in list_df:
    df['Title'] = df['Name'].apply(get_title)

In [21]:
for df in list_df:
    df['Title'] = df['Title'].replace(
        ['Lady','Countess','Capt','Col','Don','Dr','Major','Rev','Sir','Jonkheer','Dona'],'Rare')
    df['Title'] = df['Title'].replace('Mlle','Miss')
    df['Title'] = df['Title'].replace('Ms','Miss')
    df['Title'] = df['Title'].replace('Mme','Mrs')

 ## Mapping

### 'Sex'

In [22]:
for df in list_df:
    df['Sex'] = df['Sex'].map({'female':0,'male':1}).astype(int)

### 'Title'

In [23]:
for df in list_df:
    df['Title'] = df['Title'].map({'Mr':1,'Miss':2,'Mrs':3,'Master':4,'Rare':5}).astype(int)
    df['Title'] = df['Title'].fillna(0).astype(int)

### 'Embarked'

In [24]:
for df in list_df:
    df['Embarked'] = df['Embarked'].map({'S':0,'C':1,'Q':2}).astype(int)

### 'Fare'

In [25]:
df_train['CategoricalFare'].unique()

[(-0.001, 7.91], (31.0, 512.329], (7.91, 14.454], (14.454, 31.0]]
Categories (4, interval[float64]): [(-0.001, 7.91] < (7.91, 14.454] < (14.454, 31.0] < (31.0, 512.329]]

In [26]:
for df in list_df:
    df.loc[df['Fare'] <= 7.91,'Fare'] = 0
    df.loc[(df['Fare'] > 7.91) & (df['Fare'] <= 14.454),'Fare'] = 1
    df.loc[(df['Fare'] > 14.454) & (df['Fare'] <= 31),'Fare'] = 2
    df.loc[ df['Fare'] > 31, 'Fare'] = 3
    df['Fare'] = df['Fare'].astype(int)

### 'Age'

In [27]:
df_train['CategoricalAge'].unique()

[(16.0, 32.0], (32.0, 48.0], (-0.08, 16.0], (48.0, 64.0], (64.0, 80.0]]
Categories (5, interval[float64]): [(-0.08, 16.0] < (16.0, 32.0] < (32.0, 48.0] < (48.0, 64.0] < (64.0, 80.0]]

In [28]:
for df in list_df:
    df.loc[df['Age'] <= 16,'Age']= 0
    df.loc[(df['Age'] > 16) & (df['Age'] <= 32),'Age'] = 1
    df.loc[(df['Age'] > 32) & (df['Age'] <= 48),'Age'] = 2
    df.loc[(df['Age'] > 48) & (df['Age'] <= 64),'Age'] = 3
    df.loc[df['Age'] > 64,'Age'] = 4

## Feature Selection

In [29]:
drop_elements = ['PassengerId','Name','Ticket','Cabin','SibSp']

df_train = df_train.drop(drop_elements,axis = 1)
df_train = df_train.drop(['CategoricalAge','CategoricalFare'],axis = 1)

In [30]:
ids = df_test['PassengerId']

In [31]:
df_test  = df_test.drop(drop_elements,axis = 1)

In [32]:
df_train.head()

,Survived,Pclass,Sex,Age,Parch,Fare,Embarked,Name_length,Has_Cabin,FamilySize,IsAlone,Title
0,0,3,1,1,0,0,0,23,0,2,0,1
1,1,1,0,2,0,3,1,51,1,2,0,3
2,1,3,0,1,0,1,0,22,0,1,1,2
3,1,1,0,2,0,3,0,44,1,2,0,3
4,0,3,1,2,0,1,0,24,0,1,1,1

In [33]:
df_test.head()

,Pclass,Sex,Age,Parch,Fare,Embarked,Name_length,Has_Cabin,FamilySize,IsAlone,Title
0,3,1,2,0,0,2,16,0,1,1,1
1,3,0,2,0,0,0,32,0,2,0,3
2,2,1,3,0,1,2,25,0,1,1,1
3,3,1,1,0,1,0,16,0,1,1,1
4,3,0,1,1,1,0,44,0,3,0,3

## Creación Archivos pkl

In [34]:
ids.to_pickle('../Data/01.-ids.pkl')

df_train.to_pickle('../Data/01.-df_train.pkl')
df_test.to_pickle('../Data/01.-df_test.pkl')

In [35]:
!ls -l --block-size=M ../Data/01.-ids.pkl

-rw-r--r-- 1 dsc dsc 1M jul 25 10:17 ../Data/01.-ids.pkl

In [36]:
!ls -l --block-size=M ../Data/01.-df_train.pkl

-rw-r--r-- 1 dsc dsc 1M jul 25 10:17 ../Data/01.-df_train.pkl

In [37]:
!ls -l --block-size=M ../Data/01.-df_test.pkl

-rw-r--r-- 1 dsc dsc 1M jul 25 10:17 ../Data/01.-df_test.pkl